In [2]:
import numpy as np
import pandas as pd   # pd is the alias name given to pandas
np.set_printoptions(precision=4)  # setting up the decimal places to 4

In [13]:
data2 = pd.read_csv("E:/DS -Python/pandas_demo.csv")   # reading comma sepearated file (CSV) # tab separated (tsv)
                                            # by default the sep = "," you can change it whatever you want sep = "\t"
data2.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
# read tsv data. specifically for the tab separated file
data = pd.read_table("E:\DS -Python\pandas_demo1.tsv")
data.head()

C:\Users\Sunil Kumar\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

    a   b   c   d message
0  20  21  22  23   hello
1  24  25  26  27   world
2  28  29  30  31     hey

In [11]:
data = pd.read_csv("E:/DS -Python/pandas_demo.csv", header= None)  #  by default it will be header = infer 
data.head()   # taking a b c d message as data and not header using header = None

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [ ]:
data = pd.read_csv("E:/DS -Python/pandas_demo.csv", names=['name','dept','age','salary']) 
# we can also create our own header name if we choose header as None. This can be done through names = []. if you give more
# column name than the data if will add and give in  details as NaN (not a number).

In [ ]:
data = pd.read_csv("E:/DS -Python/pandas_demo.csv", skiprows=[0,2,3]) # this will skip 0,2,3 rows and display the rows

In [5]:
pd.isnull(data)   # it returns in boolean whether any NA or null (no value given) values are there. 
                    #it give True if there is any NA value

       a      b      c      d  message
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False

In [ ]:
data = pd.read_csv("E:/DS -Python/pandas_demo.csv", na_values=['Null']) # this will add NaN  in blank or NA field

In [ ]:
# Reading Excel file

In [ ]:
data = pd.read_excel("E:/DS -Python/pandas_demo.xlsx", sheetname = 'income')  # reads the income shee t from excel file

In [8]:
# reading data from html

url = "https://www.basketball-reference.com/leagues/NBA_2020.html"  
BB_data = pd.read_html(url)  # if there is a tabular format, it will read all the data 
BB_data

[          Eastern Conference  W  L   W/L%   GB   PS/G   PA/G    SRS
 0     Philadelphia 76ers (1)  5  1  0.833    —  114.0  107.3   9.45
 1             Miami Heat (1)  5  1  0.833    —  117.8  106.2  14.06
 2         Boston Celtics (3)  4  1  0.800  0.5  108.6  103.0   6.75
 3        Milwaukee Bucks (4)  5  2  0.714  0.5  121.3  110.3  13.19
 4        Toronto Raptors (5)  4  2  0.667  1.0  113.0  106.8   4.82
 5      Charlotte Hornets (6)  3  3  0.500  2.0  105.5  112.5  -7.46
 6         Indiana Pacers (6)  3  3  0.500  2.0  105.2  103.8  -6.10
 7          Brooklyn Nets (8)  3  4  0.429  2.5  121.0  120.3  -4.56
 8          Atlanta Hawks (9)  2  3  0.400  2.5  103.4  104.4   4.38
 9       Detroit Pistons (10)  3  5  0.375  3.0  107.1  112.4  -6.49
 10   Washington Wizards (11)  2  4  0.333  3.0  116.8  117.7  -0.33
 11        Orlando Magic (11)  2  4  0.333  3.0   93.5   98.2  -4.19
 12  Cleveland Cavaliers (11)  2  4  0.333  3.0  105.0  111.0  -7.81
 13        Chicago Bulls (14)  2  5  0.286  3.5  105.0  110.3 -11.45
 14      New York Knicks (15)  1  6  0.143  4.5   99.6  108.7 -10.87,
              Western Conference  W  L   W/L%   GB   PS/G   PA/G    SRS
 0        Los Angeles Lakers (1)  5  1  0.833    —  109.8   99.3  11.61
 1      Los Angeles Clippers (2)  5  2  0.714  0.5  112.9  107.3   8.88
 2              Phoenix Suns (2)  5  2  0.714  0.5  115.0  106.4   8.52
 3            Denver Nuggets (4)  4  2  0.667  1.0  103.5  103.2  -0.85
 4          Dallas Mavericks (4)  4  2  0.667  1.0  116.7  112.2   3.82
 5    Minnesota Timberwolves (4)  4  2  0.667  1.0  116.0  115.7   4.39
 6         San Antonio Spurs (4)  4  2  0.667  1.0  112.8  109.8   3.13
 7           Houston Rockets (8)  4  3  0.571  1.5  119.3  123.1  -2.71
 8                 Utah Jazz (8)  4  3  0.571  1.5  100.0   95.6   7.54
 9   Portland Trail Blazers (10)  3  4  0.429  2.5  114.4  115.3  -0.82
 10   Oklahoma City Thunder (11)  2  4  0.333  3.0  104.3  101.8   0.85
 11        Sacramento Kings (12)  2  5  0.286  3.5  101.1  110.1  -8.49
 12   Golden State Warriors (12)  2  5  0.286  3.5  111.7  120.4  -7.69
 13       Memphis Grizzlies (14)  1  5  0.167  4.0  105.5  117.3  -9.26
 14    New Orleans Pelicans (15)  1  6  0.143  4.5  119.3  124.3  -5.90,
           Eastern Conference                   W                   L  \
 0          Atlantic Division   Atlantic Division   Atlantic Division
 1     Philadelphia 76ers (1)                   5                   1
 2         Boston Celtics (3)                   4                   1
 3        Toronto Raptors (5)                   4                   2
 4          Brooklyn Nets (8)                   3                   4
 5       New York Knicks (15)                   1                   6
 6           Central Division    Central Division    Central Division
 7        Milwaukee Bucks (4)                   5                   2
 8         Indiana Pacers (6)                   3                   3
 9       Detroit Pistons (10)                   3                   5
 10  Cleveland Cavaliers (11)                   2                   4
 11        Chicago Bulls (14)                   2                   5
 12        Southeast Division  Southeast Division  Southeast Division
 13            Miami Heat (1)                   5                   1
 14     Charlotte Hornets (6)                   3                   3
 15         Atlanta Hawks (9)                   2                   3
 16   Washington Wizards (11)                   2                   4
 17        Orlando Magic (11)                   2                   4

                   W/L%                  GB                PS/G  \
 0    Atlantic Division   Atlantic Division   Atlantic Division
 1                 .833                   —               114.0
 2                 .800                 0.5               108.6
 3                 .667                 1.0               113.0
 4                 .429                 2.5               121.0
 5                 .143                 4.5                99.6
 6     Central Division    Central Division    Central Division
 7                 .714                   —               121.3
 8                 .500                 1.5               105.2
 9                 .375                 2.5               107.1
 10                .333                 2.5               105.0
 11                .286                 3.0               105.0
 12  Southeast Division  Southeast Division  Southeast Division
 13                .833                   —               117.8
 14                .500                 2.0               105.5
 15                .400                 2.5               103.4
 16                .333                 3.0               116.8
 17                .333                 3.0                93.5

                   PA/G                 SRS
 0    Atlantic Division   Atlantic Division
 1                107.3                9.45
 2                103.0                6.75
 3                106.8                4.82
 4                120.3               -4.56
 5                108.7              -10.87
 6     Central Division    Central Division
 7                110.3               13.19
 8                103.8               -6.10
 9                112.4               -6.49
 10               111.0               -7.81
 11               110.3              -11.45
 12  Southeast Division  Southeast Division
 13               106.2               14.06
 14               112.5               -7.46
 15               104.4                4.38
 16               117.7               -0.33
 17                98.2               -4.19  ,
              Western Conference                   W                   L  \
 0            Northwest Division  Northwest Division  Northwest Division
 1    Minnesota Timberwolves (4)                   4                   2
 2            Denver Nuggets (4)                   4                   2
 3                 Utah Jazz (8)                   4                   3
 4   Portland Trail Blazers (10)                   3                   4
 5    Oklahoma City Thunder (11)                   2                   4
 6              Pacific Division    Pacific Division    Pacific Division
 7        Los Angeles Lakers (1)                   5                   1
 8              Phoenix Suns (2)                   5                   2
 9      Los Angeles Clippers (2)                   5                   2
 10   Golden State Warriors (12)                   2                   5
 11        Sacramento Kings (12)                   2                   5
 12           Southwest Division  Southwest Division  Southwest Division
 13         Dallas Mavericks (4)                   4                   2
 14        San Antonio Spurs (4)                   4                   2
 15          Houston Rockets (8)                   4                   3
 16       Memphis Grizzlies (14)                   1                   5
 17    New Orleans Pelicans (15)                   1                   6

                   W/L%                  GB                PS/G  \
 0   Northwest Division  Northwest Division  Northwest Division
 1                 .667                   —               116.0
 2                 .667                   —               103.5
 3                 .571                 0.5               100.0
 4                 .429                 1.5               114.4
 5                 .333                 2.0               104.3
 6     Pacific Division    Pacific Division    Pacific Division
 7                 .833                   —               109.8
 8                 .714                 0.5               115.0
 9                 .714                 0.5               112.9
 10                .286                 3.5               111.7
 11                .286                 3.5               101.1
 12  Southwest Division  Southwest Division  Southwest Division
 13                .667                   —               116.7
 14                .667                   —               112.8
 15                .571                 0.5               119.3
 16                .167                 3.0               105.5
 17                .143                 3.5               119.3

                   PA/G                 SRS
 0   Northwest Division  Northwest Division
 1                115.7                4.39
 2                103.2               -0.85
 3                 95.6                7.54
 4                115.3               -0.82
 5                101.8                0.85
 6     Pacific Division    Pacific Division
 7                 99.3               11.61
 8                106.4                8.52
 9                107.3                8.88
 10               120.4               -7.69
 11               110.1               -8.49
 12  Southwest Division  Southwest Division
 13               112.2                3.82
 14               109.8                3.13
 15               123.1               -2.71
 16               117.3               -9.26
 17               124.3               -5.90  ]

In [9]:
BB_data[0].ix[:, 0:20].head(5)  # starting from 0th index. ix is used for filtering where all the rows and columns 
                                # from 0 to 20 needs to be displayed

C:\Users\Sunil Kumar\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

       Eastern Conference  W  L   W/L%   GB   PS/G   PA/G    SRS
0  Philadelphia 76ers (1)  5  1  0.833    —  114.0  107.3   9.45
1          Miami Heat (1)  5  1  0.833    —  117.8  106.2  14.06
2      Boston Celtics (3)  4  1  0.800  0.5  108.6  103.0   6.75
3     Milwaukee Bucks (4)  5  2  0.714  0.5  121.3  110.3  13.19
4     Toronto Raptors (5)  4  2  0.667  1.0  113.0  106.8   4.82

In [ ]:
# printing all rows from 0 - 20 columns.

In [15]:
data2[['a','b']].head  # retrives the said columns from the data frame

<bound method NDFrame.head of    a   b
0  1   2
1  5   6
2  9  10>

In [ ]:
 pd.options.display.max_rows = 10  
# globally declaring that you would like to display max 10 rows. this can be achieved
# through head() function but you need to mention everytime the head and the number of rows. But here you are declaring /
# mentioning the maximum rows to be 10 for all the data sets that you would like to view

In [22]:
Ins = pd.read_csv("E:/DS -Python/insurance.csv", nrows = 10) # with nrows = it is displaying the first 10 rows

In [23]:
Ins

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520
5   31  female  25.740         0     no  southeast   3756.62160
6   46  female  33.440         1     no  southeast   8240.58960
7   37  female  27.740         3     no  northwest   7281.50560
8   37    male  29.830         2     no  northeast   6406.41070
9   60  female  25.840         0     no  northwest  28923.13692

In [25]:
chunk_data = pd.read_csv("E:/DS -Python/insurance.csv", chunksize = 1000) # will take at max 1000kb size data and display it

In [28]:
chunk_data

# Writing data to csv

In [29]:
data2.to_csv("E:/DS -Python/demo_out.csv")

In [ ]:
 JSON Data #   Java Script object notation
            # JSON supports Dictionary. So the data will be in the form key and values

In [3]:
obj = '''{"name" : "Wes",
 "places lived": ["united states", "germany","spain"]
}'''

In [4]:
import json
result  = json.loads(obj)
result

{'name': 'Wes', 'places lived': ['united states', 'germany', 'spain']}